app/controllers/formulario_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
SELECT "countries".* FROM "countries"
SELECT "zones".* FROM "zones"
---
  def formamigavel
  	@user = User.find(current_user.id)
  	@countries = Country.all
  	@zones = Zone.all