app/controllers/home_controller.rb

  def index

    if current_user.nil?
      else
        @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1

  def perfil
    if current_user.nil?
    else
      @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1