app/views/formulario/formamigavel.html.erb

                                                                          <% @countries.each do |c| %>
                                                                            <% if c.country == @user.pais %>
---
SELECT "countries".* FROM "countries"